# Enabling service-layer on the Router  


<div style="margin: 2em 0 !important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #fdefef;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);"><h3>Resetting router configurations</h3><p> Use this section to reset your router configurations to their base config when they're just launched using the devnet sandbox UI. **If you have just reserved the devnet sandbox and this is your first lab, you will NOT need to reset the router configurations and you can skip this Red box :)**. However, if you've been running multiple labs with the same reservation, you might want to clean the palate before proceeding to make sure all the following instructions match your experience with the sandbox environment.<br/><br/> To reset the configuration, first connect to the devbox:<br/><p style="margin: 2em 0!important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #e6f2f7;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);">**Username**: admin<br/>**Password**: admin<br/>**SSH port**: 2211</p><pre><code>Laptop-terminal:$ ssh -p 2211 admin@10.10.20.170
admin@10.10.20.170's password:
Last login: Sun Aug 26 17:34:49 2018 from 192.168.122.1
admin@devbox:~$
admin@devbox:~$
</code></pre>Clone the <https://github.com/CiscoDevNet/iosxr-programmability-devnet-labs-code> github repo and drop into the `reset_setup` directory:<pre><code>admin@devbox:~$
admin@devbox:~$ git clone https://github.com/CiscoDevNet/iosxr-programmability-devnet-labs-code
Cloning into 'iosxr-programmability-devnet-labs-code'...
remote: Counting objects: 38, done.
remote: Compressing objects: 100% (27/27), done.
remote: Total 38 (delta 5), reused 33 (delta 3), pack-reused 0
Unpacking objects: 100% (38/38), done.
Checking connectivity... done.
admin@devbox:~$
admin@devbox:~$
admin@devbox:~$ cd iosxr-programmability-devnet-labs-code/reset_setup/
admin@devbox:reset_setup$ ls
configs  connection_details.sh  reset_setup.sh
admin@devbox:reset_setup$
</code></pre>Now run `./reset_setup.sh` and your router configurations should get reset:<pre><code>admin@devbox:reset_setup$ ./reset_setup.sh

Starting Reset process for Router r1....
Connection to 10.10.20.170 closed.
Configuration done!
Verifying running configuration...
Connection to 10.10.20.170 closed.
Configuration Successful!


Starting Reset process for Router r2....
Connection to 10.10.20.170 closed.
Configuration done!
Verifying running configuration...
Connection to 10.10.20.170 closed.
Configuration Successful!

admin@devbox:reset_setup$
</code></pre><p style="margin: 2em 0!important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #eff9ef;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);">And with that, you're all set to start this lab!</p></p></div>

We will use router r1 as the test subject for our client code. To begin, let's SSH over to the IOS-XR CLI of router r1.

<p style="margin: 2em 0!important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #e6f2f7;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);">**Username**: admin<br/>**Password**: admin<br/>**SSH port**: 2221
</p>  

```bash
Laptop-terminal:$ ssh -p 2221 admin@10.10.20.170


--------------------------------------------------------------------------
  Router 1 (Cisco IOS XR Sandbox)
--------------------------------------------------------------------------


Password:


RP/0/RP0/CPU0:r1#
RP/0/RP0/CPU0:r1#

```

## Enable gRPC and Select port 57777

The port forwarding rules for you are already set up to forward port 57777 on each router to a pre-determined port as shown in the connection details on the previous page. So make sure you **configure gRPC port on either router to be 57777 in order to access the gRPC server over the external NAT IP address=10.10.20.170**.  


<div style="margin: 2em 0 !important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #e6f2f7;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);"><p> By default, the gRPC server is set up for the IPv4 address family only. If you'd like to enable the gRPC port for IPv6 client connections, then use the following configuration snippet:</p><pre><code>!
grpc
  address-family ipv6
  port 57777
!
</code></pre>
</div>


```
RP/0/RP0/CPU0:r1#conf t
Mon Aug 27 01:43:18.464 UTC
RP/0/RP0/CPU0:r1(config)#
RP/0/RP0/CPU0:r1(config)#grpc
RP/0/RP0/CPU0:r1(config-grpc)#port 57777
RP/0/RP0/CPU0:r1(config-grpc)#commit
Mon Aug 27 01:43:29.726 UTC
RP/0/RP0/CPU0:r1(config-grpc)#
RP/0/RP0/CPU0:r1(config-grpc)#
RP/0/RP0/CPU0:r1#show  grpc status
Mon Aug 27 01:43:40.847 UTC
*************************show gRPC status**********************
---------------------------------------------------------------
transport                       :     grpc
access-family                   :     tcp4
TLS                             :     enabled
trustpoint                      :     
listening-port                  :     57777
max-request-per-user            :     10
max-request-total               :     128
vrf-socket-ns-path              :     global-vrf
_______________________________________________________________
*************************End of showing status*****************
RP/0/RP0/CPU0:r1#


```

## Enable Service-Layer

Service-Layer APIs are served up over gRPC. So simply enable `service-layer` under the gRPC config mode:

```
Mon Aug 27 02:00:54.657 UTC
RP/0/RP0/CPU0:r1(config)#grpc
RP/0/RP0/CPU0:r1(config-grpc)#service-layer
RP/0/RP0/CPU0:r1(config-grpc-sl)#commit
Mon Aug 27 02:00:59.676 UTC
RP/0/RP0/CPU0:r1(config-grpc-sl)#
RP/0/RP0/CPU0:r1#
RP/0/RP0/CPU0:r1#
RP/0/RP0/CPU0:r1#show service-layer state
Mon Aug 27 02:01:11.849 UTC
------------service layer state----------
config on:                   YES
standby connected :          NO
idt done:                    NO
blocked on ndt:              NO
connected to RIB for IPv4:   YES
connected to RIB for IPv6:   YES
Initialization state:        service ready
pending requests:            0         
BFD Connection:              UP
MPLS Connection:             UP
Interface Connection:        UP
Objects accepted:            NO
interface registered:        NO
bfd registered for IPv4:     NO
bfd registered for IPv6:     NO
RP/0/RP0/CPU0:r1#


```

## Disable TLS under grpc

The code we intend to write will not utilize TLS encryption: we will reserve that scenario for another lab. So to start off without any encryption, configure `no-tls` under the gRPC config mode. In the `show grpc status` output, TLS should get set to `disabled`.

```
RP/0/RP0/CPU0:r1#conf t
Mon Aug 27 02:03:23.037 UTC
RP/0/RP0/CPU0:r1(config)#grpc
RP/0/RP0/CPU0:r1(config-grpc)#no-tls
RP/0/RP0/CPU0:r1(config-grpc)#commit
Mon Aug 27 02:03:30.897 UTC
RP/0/RP0/CPU0:r1(config-grpc)#
RP/0/RP0/CPU0:r1#
RP/0/RP0/CPU0:r1#show grpc status
Mon Aug 27 02:04:06.558 UTC
*************************show gRPC status**********************
---------------------------------------------------------------
transport                       :     grpc
access-family                   :     tcp4
TLS                             :     disabled
trustpoint                      :     NotSet
listening-port                  :     57777
max-request-per-user            :     10
max-request-total               :     128
vrf-socket-ns-path              :     global-vrf
_______________________________________________________________
*************************End of showing status*****************
RP/0/RP0/CPU0:r1#

```


## Verify final gRPC configuration

At the end, for this lab, your final gRPC configuration on Router r1 should look something like:  

```
RP/0/RP0/CPU0:r1#show  running-config grpc
Mon Aug 27 02:03:35.837 UTC
grpc
 port 57777
 no-tls
 service-layer
 !
!

RP/0/RP0/CPU0:r1#

```

## Check that the ports are operations

The gRPC server runs as a Linux process on the IOS-XR system. It therefore opens up a port in the kernel on the Router Processor (RP) module.   
This port also gets programmed into the LPTS (Local Packet Transport Services) component of IOS-XR that maintains a distributed table across all nodes (RP, Linecards) of the Router to enable clients to connect to the gRPC port over distributed line card ports along with the Management Port.  

We can check these states as shown below:  

### gRPC port in the RP kernel  

```
RP/0/RP0/CPU0:r1#
RP/0/RP0/CPU0:r1#bash
Sat Sep  1 23:54:31.555 UTC
[r1:~]$
[r1:~]$
[r1:~]$ netstat -nlp | grep 57777
tcp        0      0 0.0.0.0:57777           0.0.0.0:*               LISTEN      10581/emsd      
[r1:~]$

```

### gRPC port in LPTS

```
RP/0/RP0/CPU0:r1#show  lpts  pifib brief  | i 57777
Sat Sep  1 23:55:25.425 UTC
 IPv4       default  TCP    any          0/RP0/CPU0   any,57777 any
RP/0/RP0/CPU0:r1#

```


<p style="margin: 2em 0!important;padding: 1em;font-family: CiscoSans,Arial,Helvetica,sans-serif;font-size: 1em !important;text-indent: initial;background-color: #eff9ef;border-radius: 5px;box-shadow: 0 1px 1px rgba(0,127,171,0.25);">You have the service-layer gRPC server running. Now, let's move on to the client code.  </p>
